# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

### Load Required Libraries

In [2]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [2]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin123")

cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [3]:
cursorObject.execute("CREATE DATABASE e_commerce")

connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [4]:
## Again connect to the Mysql server and while connecting Choose 'e_commerce' database
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin123",
                                     database = 'e_commerce')
 
## creating a cursor object
cursorObject = connection.cursor()


## Solution for Q1: Creating tables 
table_creation_query = """create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), 
                          SUPP_PHONE varchar(10));

                          create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, 
                          CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,
                          PRIMARY KEY (CUS_ID));

                          create table category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
                          PRIMARY KEY (CAT_ID));

                          create table product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, 
                          PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,
                          PRIMARY KEY (PRO_ID),
                          FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));

                          create table product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
                          PROD_PRICE INT NOT NULL, 
                          PRIMARY KEY (PROD_ID),
                          FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), 
                          FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));

                          create table `order`(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, 
                          PROD_ID INT NOT NULL,
                          PRIMARY KEY (ORD_ID),
                          FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
                          FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                          
                          create table rating(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
                          RAT_RATSTARS INT NOT NULL,
                          PRIMARY KEY (RAT_ID),
                          FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
                          FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""
                  
# Executing the query
cursorObject.execute(table_creation_query)

In [21]:
connection.close()

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [16]:
# re-opening connection
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin123",
                                     database = 'e_commerce')
cursorObject = connection.cursor()


# insert into "supplier" table
insert_into_supplier = """INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s);"""

val = [(1, 'Rajesh Retails', 'Delhi', '1234567890'),(2, 'Appario Ltd.', 'Mumbai', '8963147032'),
      (3, 'Knome products', 'Bangalore', '9785462315'),(4, 'Bansal Retails', 'Kochi', '8975463285'),
      (5, 'Mittal Ltd.', 'Lucknow', '7898456532')]

cursorObject.executemany(insert_into_supplier, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [14]:
# insert into "customer" table
insert_into_customer = """INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) 
                            VALUES (%s, %s, %s, %s, %s);"""

val = [(1, 'AAKASH', '9999999999', 'DELHI','M'),(2, 'AMAN', '9785463215', 'NOIDA','M'),
      (3, 'NEHA', '9999999998', 'MUMBAI','F'),(4, 'MEGHA', '9994562399', 'KOLKATA','F'),
      (5, 'PULKIT', '7895999999', 'LUCKNOW','M')]

cursorObject.executemany(insert_into_customer, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [16]:
# insert into "category" table
insert_into_category = """INSERT INTO category (CAT_ID, CAT_NAME) 
                            VALUES (%s, %s);"""

val = [(1, 'BOOKS'),(2, 'GAMES'),
      (3, 'GROCERIES'),(4, 'ELECTRONICS'),
      (5, 'CLOTHES')]

cursorObject.executemany(insert_into_category, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [17]:
# insert into "product" table
insert_into_product = """INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) 
                            VALUES (%s, %s, %s, %s);"""

val = [(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2),(2, 'TSHIRT', 'DFDFJDFJDKFD', 5),
      (3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4),(4, 'OATS', 'REURENTBTOTH', 3),
      (5, 'HARRY POTTER', 'NBEMCTHTJTH', 1)]

cursorObject.executemany(insert_into_product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [18]:
# insert into "product_details" table
insert_into_prod_dtls = """INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) 
                            VALUES (%s, %s, %s, %s);"""

val = [(1, 1, 2, 1500),(2, 3, 5, 30000),
      (3, 5, 1, 3000),(4, 2, 3, 2500),
      (5, 4, 1, 1000)]

cursorObject.executemany(insert_into_prod_dtls, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [19]:
# insert into "orders" table
insert_into_order = """INSERT INTO `order` (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) 
                            VALUES (%s, %s, %s, %s, %s);"""

val = [(20, 1500, '2021-10-12', 3, 5),(2, 30500, '2021-09-16', 5, 2),
      (3, 2000, '2021-10-05', 1, 1),(4, 3500, '2021-08-16', 4, 3),
      (5, 2000, '2021-10-06', 2, 1)]

cursorObject.executemany(insert_into_order, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [20]:
# insert into "rating" table
insert_into_rating = """INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) 
                            VALUES (%s, %s, %s, %s);"""

val = [(1, 2, 2, 4),(2, 3, 4, 3),
      (3, 5, 1, 5),(4, 1, 3, 2),
      (5, 4, 5, 4)]

cursorObject.executemany(insert_into_rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [4]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin123",
                                     database = 'e_commerce')
cursorObject = connection.cursor()

query_3 = """SELECT CUSTOMER.CUS_GENDER, COUNT(CUSTOMER.CUS_GENDER) AS COUNT FROM CUSTOMER INNER JOIN `ORDER` 
             ON CUSTOMER.CUS_ID=`ORDER`.CUS_ID WHERE `ORDER`.ORD_AMOUNT>=3000 GROUP BY CUSTOMER.CUS_GENDER;"""

cursorObject.execute(query_3)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CUS_GENDER','COUNT'])
output_df

  CUS_GENDER  COUNT
0          M      1
1          F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [5]:
query_4 = """SELECT `ORDER`.*, PRODUCT.PRO_NAME FROM `ORDER`, PRODUCT_DETAILS, PRODUCT WHERE `ORDER`.CUS_ID=2 
             AND `ORDER`.PROD_ID = PRODUCT_DETAILS.PROD_ID AND PRODUCT_DETAILS.PRO_ID = PRODUCT.PRO_ID;"""

cursorObject.execute(query_4)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0       5        2000  2021-10-06       2        1    GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [6]:
query_5 = """SELECT SUPPLIER.* FROM SUPPLIER WHERE SUPPLIER.SUPP_ID IN 
             (SELECT SUPP_ID FROM PRODUCT_DETAILS GROUP BY SUPP_ID HAVING COUNT(SUPP_ID) > 1)
             GROUP BY SUPPLIER.SUPP_ID;"""

cursorObject.execute(query_5)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [8]:
query_6 = """SELECT CATEGORY.* FROM `ORDER` INNER JOIN PRODUCT_DETAILS ON `ORDER`.PROD_ID = PRODUCT_DETAILS.PROD_ID 
             INNER JOIN PRODUCT ON PRODUCT.PRO_ID = PRODUCT_DETAILS.PRO_ID
             INNER JOIN CATEGORY ON CATEGORY.CAT_ID = PRODUCT.CAT_ID 
             WHERE `ORDER`.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) FROM `ORDER`);"""

cursorObject.execute(query_6)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CAT_ID','CAT_NAME'])
output_df

   CAT_ID   CAT_NAME
0       3  GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [9]:
query_7 = """SELECT PRODUCT.PRO_ID, PRODUCT.PRO_NAME FROM PRODUCT 
             INNER JOIN PRODUCT_DETAILS ON PRODUCT.PRO_ID = PRODUCT_DETAILS.PRO_ID 
             INNER JOIN `ORDER` ON `ORDER`.PROD_ID = PRODUCT_DETAILS.PROD_ID 
             WHERE `ORDER`.ORD_DATE > "2021-10-05";"""

cursorObject.execute(query_7)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME'])
output_df

   PRO_ID PRO_NAME
0       1    GTA V
1       4     OATS

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [10]:
query_8 = """SELECT SUPPLIER.SUPP_ID, SUPPLIER.SUPP_NAME, CUSTOMER.CUS_ID, CUSTOMER.CUS_NAME, RATING.RAT_RATSTARS FROM RATING 
             INNER JOIN SUPPLIER ON RATING.SUPP_ID = SUPPLIER.SUPP_ID 
             INNER JOIN CUSTOMER ON RATING.CUS_ID = CUSTOMER.CUS_ID 
             ORDER BY RATING.RAT_RATSTARS DESC LIMIT 3;"""

cursorObject.execute(query_8)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','CUS_ID','CUS_NAME','RAT_RATSTARS'])
output_df

   SUPP_ID       SUPP_NAME  CUS_ID CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails       5   PULKIT             5
1        2    Appario Ltd.       2     AMAN             4
2        5     Mittal Ltd.       4    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [11]:
query_9 = """SELECT CUS_NAME, CUS_GENDER FROM CUSTOMER WHERE CUS_NAME LIKE '%A%';"""

cursorObject.execute(query_9)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [12]:
query_10 = """SELECT SUM(ORD_AMOUNT) AS TOTAL_AMOUNT FROM `ORDER` WHERE CUS_ID IN 
              (SELECT CUS_ID FROM CUSTOMER WHERE CUS_GENDER='M');"""

cursorObject.execute(query_10)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['TOTAL_AMOUNT'])
output_df

  TOTAL_AMOUNT
0        34500

### Q11) Display all the Customers left outer join with  the orders

In [13]:
query_11 = """SELECT CUSTOMER.*, `ORDER`.ORD_ID, `ORDER`.ORD_AMOUNT, `ORDER`.ORD_DATE, `ORDER`.PROD_ID FROM CUSTOMER 
              LEFT OUTER JOIN `ORDER` ON CUSTOMER.CUS_ID=`ORDER`.CUS_ID;"""

cursorObject.execute(query_11)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER',
                                          'ORD_ID','ORD_AMOUNT','ORD_DATE','PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,3,2000,2021-10-05,1
1,2,AMAN,9785463215,NOIDA,M,5,2000,2021-10-06,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,5
3,4,MEGHA,9994562399,KOLKATA,F,4,3500,2021-08-16,3
4,5,PULKIT,7895999999,LUCKNOW,M,2,30500,2021-09-16,2

In [14]:
# query result along with product name

query_11 = """SELECT CUSTOMER.*, `ORDER`.ORD_ID, `ORDER`.ORD_AMOUNT, `ORDER`.ORD_DATE, `ORDER`.PROD_ID, PRODUCT.PRO_NAME FROM CUSTOMER 
              LEFT OUTER JOIN `ORDER` ON CUSTOMER.CUS_ID=`ORDER`.CUS_ID
              LEFT OUTER JOIN PRODUCT_DETAILS ON PRODUCT_DETAILS.PROD_ID=`ORDER`.PROD_ID
              LEFT OUTER JOIN PRODUCT ON PRODUCT.PRO_ID=PRODUCT_DETAILS.PRO_ID;"""

cursorObject.execute(query_11)

output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER',
                                          'ORD_ID','ORD_AMOUNT','ORD_DATE','PROD_ID','PRO_NAME'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,PROD_ID,PRO_NAME
0,1,AAKASH,9999999999,DELHI,M,3,2000,2021-10-05,1,GTA V
1,2,AMAN,9785463215,NOIDA,M,5,2000,2021-10-06,1,GTA V
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,5,OATS
3,4,MEGHA,9994562399,KOLKATA,F,4,3500,2021-08-16,3,HARRY POTTER
4,5,PULKIT,7895999999,LUCKNOW,M,2,30500,2021-09-16,2,ROG LAPTOP

In [17]:
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)